# IdeaStatiCa.RcsApi.Model.CutData
Provides data of the cut beam

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**PlanePoint** | **Point3D** |  | [optional]
**NormalVector** | **Vector3D** |  | [optional]
**Direction** | **CutOrientation** |  | [optional]
**Offset** | **double** | Offset - shift of cut | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)